/*
  การอ่านค่าตัวต้านทานปรับค่าได้ผ่านทางจอภาพ (Serial Monitor)
  
  การอ่านค่าแบบอนาล็อคจะต่อผ่านขา D0 - D13 และสามารถแสดงค่าที่อ่านได้ออกจากจอภาพ (Serial Monitor)
  และสามารถอ่านค่าแบบกราฟ (Serial Plotter) ได้โดยกดไปที่ Tools > Serial Plotter menu
  
  Attach the center pin of a potentiometer to pin A0, and the outside pins to +5V and ground.

*/

// ส่วนของการตั้งค่าจะตั้งค่าใหม่ทุกครั้งเมื่อมีการรีเซ็ต
void setup() { 
  // คำสั่งเปิดพอร์ตอ่านข้อมูลผ่านทางจอภาพที่พอร์ต 9600
  Serial.begin(9600);
}

// ส่วนของการทำงานที่ละบรรทัดและจะทำงานวนลูปไปเรื่อย ๆ
void loop() {
  // การสร้างตัวแปรเก็บค่าแบบ int ที่มีชื่อว่า sensorValue ที่มีการเก็บค่าการอ่านแบบอนาล็อคโดยใช้คำสั่ง analogRead และตามด้วยตำแหน่งขาที่จะอ่านข้อมูลคือ (A0) และปิดท้ายตด้วยเซมิโคลอน ;
  int sensorValue = analogRead(A0);
  // การสร้างตัวแปรเก็บค่าแบบ float ที่มีชื่อว่า voltage ที่มีการเก็บค่าการคำนวนของตัวแปร sensorValue * (5.0 / 1023.0) และปิดท้ายตด้วยเซมิโคลอน ;
  float voltage = sensorValue * (5.0 / 1023.0);
  // การแสดงค่าข้อมูลแบบขึ้นบรรทัดใหม่ โดยใช้คำสั่ง Serial.println และตามด้วยตำแหน่งหรือตัวแปรที่เก็บค่านั้นไว้ (sensorValue) และปิดท้ายตด้วยเซมิโคลอน ;
  Serial.println(voltage);
}
