/*
  การอ่านค่าดิจิตอลผ่านทาง Serial Monitor

  การอ่านค่าแบบอนาล็อคจะต่อผ่านขา 2 และสามารถแสดงค่าที่อ่านได้ออกจากจอภาพ (Serial Monitor)

*/

// การสร้างตัวแปรเก็บค่าแบบ int ที่มีชื่อว่า pushButton ที่มีการเก็บค่าตัวเลข 2;
int pushButton = 2;

// ส่วนของการตั้งค่าจะตั้งค่าใหม่ทุกครั้งเมื่อมีการรีเซ็ต
void setup() {
  // คำสั่งเปิดพอร์ตอ่านข้อมูลผ่านทางจอภาพที่พอร์ต 9600
  Serial.begin(9600);
  /*คำสั่งการกำหนดชนิดของขาอุปกรณ์ 
  โดยใช้คำสั่ง pinMode และจะตามด้วยตัวแปรหรือตำแหน่งขา (pushButton, 
  และตามต่อด้วยสถานะ INPUT)และปิดท้ายด้วยเซมิโคลอน ;
  */
  pinMode(pushButton, INPUT);
}

// ส่วนของการทำงานที่ละบรรทัดและจะทำงานวนลูปไปเรื่อย ๆ
void loop() {
  // การสร้างตัวแปรเก็บค่าแบบ int ที่มีชื่อว่า buttonState ที่มีการเก็บค่าการอ่านแบบอนาล็อคโดยใช้คำสั่ง digitalRead และตามด้วยตำแหน่งขาหรือตัวแปรที่จะอ่านข้อมูลคือ (pushButton) และปิดท้ายตด้วยเซมิโคลอน ;
  int buttonState = digitalRead(pushButton);
  // การแสดงค่าข้อมูลแบบขึ้นบรรทัดใหม่ โดยใช้คำสั่ง Serial.println และตามด้วยตำแหน่งหรือตัวแปรที่เก็บค่านั้นไว้ (buttonState) และปิดท้ายตด้วยเซมิโคลอน ;
  Serial.println(buttonState);
  // ฟังก์ชันการหน่วงเวลา
  delay(1);        
}
